Enums/КлассыУсловийТрудаПоРезультатамСпециальнойОценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>КлассыУсловийТрудаПоРезультатамСпециальнойОценки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Опасный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вредный1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вредный2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вредный3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вредный4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Допустимый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оптимальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/КлассыУсловийТрудаКлиентСервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает вредные (опасные) классы условий труда.
//
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.КлассыУсловийТрудаПоРезультатамСпециальнойОценки
//
Функция ВредныеИОпасныеКлассыУсловийТруда() Экспорт

	ВредныеКлассы = Новый Массив;
	ВредныеКлассы.Добавить(ПредопределенноеЗначение("Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1"));
	ВредныеКлассы.Добавить(ПредопределенноеЗначение("Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2"));
	ВредныеКлассы.Добавить(ПредопределенноеЗначение("Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3"));
	ВредныеКлассы.Добавить(ПредопределенноеЗначение("Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4"));
	ВредныеКлассы.Добавить(ПредопределенноеЗначение("Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный"));

	Возврат ВредныеКлассы;

КонецФункции

// Возвращает классы условий труда, при которых флаг ВыявленыВредныеОпасныеФакторы нельзя редактировать вручную.
//
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.КлассыУсловийТрудаПоРезультатамСпециальнойОценки
//
Функция КлассыУсловийТрудаДляБлокировкиФлагаВредныхФакторов() Экспорт

	ОграничивающиеКлассы = Новый Массив;
	ОграничивающиеКлассы.Добавить(
		ПредопределенноеЗначение("Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка"));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОграничивающиеКлассы, ВредныеИОпасныеКлассыУсловийТруда());

	Возврат ОграничивающиеКлассы;

КонецФункции

// Устанавливает доступность поля флага ВыявленыВредныеОпасныеФакторы на форме в зависимости от класса условий труда.
//
// Параметры:
//  Элементы - ЭлементыФормы - 
//  КлассУсловийТруда - ПеречислениеСсылка.КлассыУсловийТрудаПоРезультатамСпециальнойОценки - 
//  ИмяЭлементаФлага - Строка - 
//
Процедура УстановитьДоступностьФлагаВредныхФакторов(Элементы, КлассУсловийТруда,
	ИмяЭлементаФлага = "КлассыУсловийТрудаПоДолжностямВыявленыВредныеОпасныеФакторы") Экспорт

	БлокироватьВыявленныеФакторы = КлассыУсловийТрудаДляБлокировкиФлагаВредныхФакторов().Найти(КлассУсловийТруда) <> Неопределено;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, ИмяЭлементаФлага, "ТолькоПросмотр", БлокироватьВыявленныеФакторы);

КонецПроцедуры

#КонецОбласти
